Repository: pidev-team-2026/tgv-delivery
Catalog: translations/validators.*.xlf
Languages: fr

source: This value should be false.
fr: Cette valeur doit être fausse.

source: This value should be true.
fr: Cette valeur doit être vraie.

source: This value should be of type {{ type }}.
fr: Cette valeur doit être de type {{ type }}.

source: This value should be blank.
fr: Cette valeur doit être vide.

source: The value you selected is not a valid choice.
fr: Cette valeur doit être l'un des choix proposés.

source: You must select at least {{ limit }} choice.|You must select at least {{ limit }} choices.
fr: Vous devez sélectionner au moins {{ limit }} choix.|Vous devez sélectionner au moins {{ limit }} choix.

source: You must select at most {{ limit }} choice.|You must select at most {{ limit }} choices.
fr: Vous devez sélectionner au maximum {{ limit }} choix.|Vous devez sélectionner au maximum {{ limit }} choix.

source: One or more of the given values is invalid.
fr: Une ou plusieurs des valeurs soumises sont invalides.

source: This field was not expected.
fr: Ce champ n'a pas été prévu.

source: This field is missing.
fr: Ce champ est manquant.

source: This value is not a valid date.
fr: Cette valeur n'est pas une date valide.

source: This value is not a valid datetime.
fr: Cette valeur n'est pas une date valide.

source: This value is not a valid email address.
fr: Cette valeur n'est pas une adresse email valide.

source: The file could not be found.
fr: Le fichier n'a pas été trouvé.

source: The file is not readable.
fr: Le fichier n'est pas lisible.

source: The file is too large ({{ size }} {{ suffix }}). Allowed maximum size is {{ limit }} {{ suffix }}.
fr: Le fichier est trop volumineux ({{ size }} {{ suffix }}). Sa taille ne doit pas dépasser {{ limit }} {{ suffix }}.

source: The mime type of the file is invalid ({{ type }}). Allowed mime types are {{ types }}.
fr: Le type du fichier est invalide ({{ type }}). Les types autorisés sont {{ types }}.

source: This value should be {{ limit }} or less.
fr: Cette valeur doit être inférieure ou égale à {{ limit }}.

source: This value is too long. It should have {{ limit }} character or less.|This value is too long. It should have {{ limit }} characters or less.
fr: Cette chaîne est trop longue. Elle doit avoir au maximum {{ limit }} caractère.|Cette chaîne est trop longue. Elle doit avoir au maximum {{ limit }} caractères.

source: This value should be {{ limit }} or more.
fr: Cette valeur doit être supérieure ou égale à {{ limit }}.

source: This value is too short. It should have {{ limit }} character or more.|This value is too short. It should have {{ limit }} characters or more.
fr: Cette chaîne est trop courte. Elle doit avoir au minimum {{ limit }} caractère.|Cette chaîne est trop courte. Elle doit avoir au minimum {{ limit }} caractères.

source: This value should not be blank.
fr: Cette valeur ne doit pas être vide.

source: This value should not be null.
fr: Cette valeur ne doit pas être nulle.

source: This value should be null.
fr: Cette valeur doit être nulle.

source: This value is not valid.
fr: Cette valeur n'est pas valide.

source: This value is not a valid time.
fr: Cette valeur n'est pas une heure valide.

source: This value is not a valid URL.
fr: Cette valeur n'est pas une URL valide.

source: The two values should be equal.
fr: Les deux valeurs doivent être identiques.

source: The file is too large. Allowed maximum size is {{ limit }} {{ suffix }}.
fr: Le fichier est trop volumineux. Sa taille ne doit pas dépasser {{ limit }} {{ suffix }}.

source: The file is too large.
fr: Le fichier est trop volumineux.

source: The file could not be uploaded.
fr: Le téléchargement de ce fichier est impossible.

source: This value should be a valid number.
fr: Cette valeur doit être un nombre.

source: This file is not a valid image.
fr: Ce fichier n'est pas une image valide.

source: This is not a valid IP address.
fr: Cette valeur n'est pas une adresse IP valide.

source: This value is not a valid language.
fr: Cette langue n'est pas valide.

source: This value is not a valid locale.
fr: Ce paramètre régional n'est pas valide.

source: This value is not a valid country.
fr: Ce pays n'est pas valide.

source: This value is already used.
fr: Cette valeur est déjà utilisée.

source: The size of the image could not be detected.
fr: La taille de l'image n'a pas pu être détectée.

source: The image width is too big ({{ width }}px). Allowed maximum width is {{ max_width }}px.
fr: La largeur de l'image est trop grande ({{ width }}px). La largeur maximale autorisée est de {{ max_width }}px.

source: The image width is too small ({{ width }}px). Minimum width expected is {{ min_width }}px.
fr: La largeur de l'image est trop petite ({{ width }}px). La largeur minimale attendue est de {{ min_width }}px.

source: The image height is too big ({{ height }}px). Allowed maximum height is {{ max_height }}px.
fr: La hauteur de l'image est trop grande ({{ height }}px). La hauteur maximale autorisée est de {{ max_height }}px.

source: The image height is too small ({{ height }}px). Minimum height expected is {{ min_height }}px.
fr: La hauteur de l'image est trop petite ({{ height }}px). La hauteur minimale attendue est de {{ min_height }}px.

source: This value should be the user's current password.
fr: Cette valeur doit être le mot de passe actuel de l'utilisateur.

source: This value should have exactly {{ limit }} character.|This value should have exactly {{ limit }} characters.
fr: Cette chaîne doit avoir exactement {{ limit }} caractère.|Cette chaîne doit avoir exactement {{ limit }} caractères.

source: The file was only partially uploaded.
fr: Le fichier a été partiellement transféré.

source: No file was uploaded.
fr: Aucun fichier n'a été transféré.

source: No temporary folder was configured in php.ini.
fr: Aucun répertoire temporaire n'a été configuré dans le php.ini, ou le répertoire configuré n'existe pas.

source: Cannot write temporary file to disk.
fr: Impossible d'écrire le fichier temporaire sur le disque.

source: A PHP extension caused the upload to fail.
fr: Une extension PHP a empêché le transfert du fichier.

source: This collection should contain {{ limit }} element or more.|This collection should contain {{ limit }} elements or more.
fr: Cette collection doit contenir {{ limit }} élément ou plus.|Cette collection doit contenir {{ limit }} éléments ou plus.

source: This collection should contain {{ limit }} element or less.|This collection should contain {{ limit }} elements or less.
fr: Cette collection doit contenir {{ limit }} élément ou moins.|Cette collection doit contenir {{ limit }} éléments ou moins.

source: This collection should contain exactly {{ limit }} element.|This collection should contain exactly {{ limit }} elements.
fr: Cette collection doit contenir exactement {{ limit }} élément.|Cette collection doit contenir exactement {{ limit }} éléments.

source: Invalid card number.
fr: Numéro de carte invalide.

source: Unsupported card type or invalid card number.
fr: Type de carte non supporté ou numéro invalide.

source: This is not a valid International Bank Account Number (IBAN).
fr: Cette valeur n'est pas un Numéro de Compte Bancaire International (IBAN) valide.

source: This value is not a valid ISBN-10.
fr: Cette valeur n'est pas un code ISBN-10 valide.

source: This value is not a valid ISBN-13.
fr: Cette valeur n'est pas un code ISBN-13 valide.

source: This value is neither a valid ISBN-10 nor a valid ISBN-13.
fr: Cette valeur n'est ni un code ISBN-10, ni un code ISBN-13 valide.

source: This value is not a valid ISSN.
fr: Cette valeur n'est pas un code ISSN valide.

source: This value is not a valid currency.
fr: Cette valeur n'est pas une devise valide.

source: This value should be equal to {{ compared_value }}.
fr: Cette valeur doit être égale à {{ compared_value }}.

source: This value should be greater than {{ compared_value }}.
fr: Cette valeur doit être supérieure à {{ compared_value }}.

source: This value should be greater than or equal to {{ compared_value }}.
fr: Cette valeur doit être supérieure ou égale à {{ compared_value }}.

source: This value should be identical to {{ compared_value_type }} {{ compared_value }}.
fr: Cette valeur doit être identique à {{ compared_value_type }} {{ compared_value }}.

source: This value should be less than {{ compared_value }}.
fr: Cette valeur doit être inférieure à {{ compared_value }}.

source: This value should be less than or equal to {{ compared_value }}.
fr: Cette valeur doit être inférieure ou égale à {{ compared_value }}.

source: This value should not be equal to {{ compared_value }}.
fr: Cette valeur ne doit pas être égale à {{ compared_value }}.

source: This value should not be identical to {{ compared_value_type }} {{ compared_value }}.
fr: Cette valeur ne doit pas être identique à {{ compared_value_type }} {{ compared_value }}.

source: The image ratio is too big ({{ ratio }}). Allowed maximum ratio is {{ max_ratio }}.
fr: Le rapport largeur/hauteur de l'image est trop grand ({{ ratio }}). Le rapport maximal autorisé est {{ max_ratio }}.

source: The image ratio is too small ({{ ratio }}). Minimum ratio expected is {{ min_ratio }}.
fr: Le rapport largeur/hauteur de l'image est trop petit ({{ ratio }}). Le rapport minimal attendu est {{ min_ratio }}.

source: The image is square ({{ width }}x{{ height }}px). Square images are not allowed.
fr: L'image est carrée ({{ width }}x{{ height }}px). Les images carrées ne sont pas autorisées.

source: The image is landscape oriented ({{ width }}x{{ height }}px). Landscape oriented images are not allowed.
fr: L'image est au format paysage ({{ width }}x{{ height }}px). Les images au format paysage ne sont pas autorisées.

source: The image is portrait oriented ({{ width }}x{{ height }}px). Portrait oriented images are not allowed.
fr: L'image est au format portrait ({{ width }}x{{ height }}px). Les images au format portrait ne sont pas autorisées.

source: An empty file is not allowed.
fr: Un fichier vide n'est pas autorisé.

source: The host could not be resolved.
fr: Le nom de domaine n'a pas pu être résolu.

source: This value does not match the expected {{ charset }} charset.
fr: Cette valeur ne correspond pas au jeu de caractères {{ charset }} attendu.

source: This is not a valid Business Identifier Code (BIC).
fr: Cette valeur n'est pas un Code Identifiant de Business (BIC) valide.

source: Error
fr: Erreur

source: This is not a valid UUID.
fr: Cette valeur n'est pas un UUID valide.

source: This value should be a multiple of {{ compared_value }}.
fr: Cette valeur doit être un multiple de {{ compared_value }}.

source: This Business Identifier Code (BIC) is not associated with IBAN {{ iban }}.
fr: Ce code d'identification d'entreprise (BIC) n'est pas associé à l'IBAN {{ iban }}.

source: This value should be valid JSON.
fr: Cette valeur doit être un JSON valide.

source: This collection should contain only unique elements.
fr: Cette collection ne doit pas comporter de doublons.

source: This value should be positive.
fr: Cette valeur doit être strictement positive.

source: This value should be either positive or zero.
fr: Cette valeur doit être supérieure ou égale à zéro.

source: This value should be negative.
fr: Cette valeur doit être strictement négative.

source: This value should be either negative or zero.
fr: Cette valeur doit être inférieure ou égale à zéro.

source: This value is not a valid timezone.
fr: Cette valeur n'est pas un fuseau horaire valide.

source: This password has been leaked in a data breach, it must not be used. Please use another password.
fr: Ce mot de passe a été divulgué lors d'une fuite de données, il ne doit plus être utilisé. Veuillez utiliser un autre mot de passe.

source: This value should be between {{ min }} and {{ max }}.
fr: Cette valeur doit être comprise entre {{ min }} et {{ max }}.

source: This value is not a valid hostname.
fr: Cette valeur n'est pas un nom d'hôte valide.

source: The number of elements in this collection should be a multiple of {{ compared_value }}.
fr: Le nombre d'éléments de cette collection doit être un multiple de {{ compared_value }}.

source: This value should satisfy at least one of the following constraints:
fr: Cette valeur doit satisfaire à au moins une des contraintes suivantes :

source: Each element of this collection should satisfy its own set of constraints.
fr: Chaque élément de cette collection doit satisfaire à son propre jeu de contraintes.

source: This value is not a valid International Securities Identification Number (ISIN).
fr: Cette valeur n'est pas un code international de sécurité valide (ISIN).

source: This value should be a valid expression.
fr: Cette valeur doit être une expression valide.

source: This value is not a valid CSS color.
fr: Cette valeur n'est pas une couleur CSS valide.

source: This value is not a valid CIDR notation.
fr: Cette valeur n'est pas une notation CIDR valide.

source: The value of the netmask should be between {{ min }} and {{ max }}.
fr: La valeur du masque de réseau doit être comprise entre {{ min }} et {{ max }}.

source: The filename is too long. It should have {{ filename_max_length }} character or less.|The filename is too long. It should have {{ filename_max_length }} characters or less.
fr: Le nom du fichier est trop long. Il doit contenir au maximum {{ filename_max_length }} caractère.|Le nom de fichier est trop long. Il doit contenir au maximum {{ filename_max_length }} caractères.

source: The password strength is too low. Please use a stronger password.
fr: La force du mot de passe est trop faible. Veuillez utiliser un mot de passe plus fort.

source: This value contains characters that are not allowed by the current restriction-level.
fr: Cette valeur contient des caractères qui ne sont pas autorisés par le niveau de restriction actuel.

source: Using invisible characters is not allowed.
fr: Utiliser des caractères invisibles n'est pas autorisé.

source: Mixing numbers from different scripts is not allowed.
fr: Mélanger des chiffres provenant de différents scripts n'est pas autorisé.

source: Using hidden overlay characters is not allowed.
fr: Utiliser des caractères de superposition cachés n'est pas autorisé.

source: The extension of the file is invalid ({{ extension }}). Allowed extensions are {{ extensions }}.
fr: L'extension du fichier est invalide ({{ extension }}). Les extensions autorisées sont {{ extensions }}.

source: The detected character encoding is invalid ({{ detected }}). Allowed encodings are {{ encodings }}.
fr: L'encodage de caractères détecté est invalide ({{ detected }}). Les encodages autorisés sont {{ encodings }}.

source: This value is not a valid MAC address.
fr: Cette valeur n'est pas une adresse MAC valide.

source: This URL is missing a top-level domain.
fr: Cette URL doit contenir un domaine de premier niveau.

source: This value is too short. It should contain at least one word.|This value is too short. It should contain at least {{ min }} words.
fr: Cette valeur est trop courte. Elle doit contenir au moins un mot.|Cette valeur est trop courte. Elle doit contenir au moins {{ min }} mots.

source: This value is too long. It should contain one word.|This value is too long. It should contain {{ max }} words or less.
fr: Cette valeur est trop longue. Elle doit contenir au maximum un mot.|Cette valeur est trop longue. Elle doit contenir au maximum {{ max }} mots.

source: This value does not represent a valid week in the ISO 8601 format.
fr: Cette valeur ne représente pas une semaine valide au format ISO 8601.

source: This value is not a valid week.
fr: Cette valeur n'est pas une semaine valide.

# This value should not be before week &quot;{{ min }}&quot;.
source: This value should not be before week "{{ min }}".
fr: Cette valeur ne doit pas être antérieure à la semaine "{{ min }}".

# This value should not be after week &quot;{{ max }}&quot;.
source: This value should not be after week "{{ max }}".
fr: Cette valeur ne doit pas être postérieure à la semaine "{{ max }}".

source: This value is not a valid Twig template.
fr: Cette valeur n'est pas un modèle Twig valide.

source: This file is not a valid video.
fr: Ce fichier n’est pas une vidéo valide.

source: The size of the video could not be detected.
fr: La taille de la vidéo n’a pas pu être détectée.

source: The video width is too big ({{ width }}px). Allowed maximum width is {{ max_width }}px.
fr: La largeur de la vidéo est trop grande ({{ width }}px). La largeur maximale autorisée est de {{ max_width }}px.

source: The video width is too small ({{ width }}px). Minimum width expected is {{ min_width }}px.
fr: La largeur de la vidéo est trop petite ({{ width }}px). La largeur minimale attendue est de {{ min_width }}px.

source: The video height is too big ({{ height }}px). Allowed maximum height is {{ max_height }}px.
fr: La hauteur de la vidéo est trop grande ({{ height }}px). La hauteur maximale autorisée est de {{ max_height }}px.

source: The video height is too small ({{ height }}px). Minimum height expected is {{ min_height }}px.
fr: La hauteur de la vidéo est trop petite ({{ height }}px). La hauteur minimale attendue est de {{ min_height }}px.

source: The video has too few pixels ({{ pixels }} pixels). Minimum amount expected is {{ min_pixels }} pixels.
fr: La vidéo a trop peu de pixels ({{ pixels }}). La quantité minimale attendue est de {{ min_pixels }} pixels.

source: The video has too many pixels ({{ pixels }} pixels). Maximum amount expected is {{ max_pixels }} pixels.
fr: La vidéo contient trop de pixels ({{ pixels }}). La quantité maximale attendue est de {{ max_pixels }} pixels.

source: The video ratio is too big ({{ ratio }}). Allowed maximum ratio is {{ max_ratio }}.
fr: Le ratio de la vidéo est trop élevé ({{ ratio }}). Le ratio maximal autorisé est de {{ max_ratio }}.

source: The video ratio is too small ({{ ratio }}). Minimum ratio expected is {{ min_ratio }}.
fr: Le ratio de la vidéo est trop petit ({{ ratio }}). Le ratio minimum attendu est de {{ min_ratio }}.

source: The video is square ({{ width }}x{{ height }}px). Square videos are not allowed.
fr: La vidéo est carrée ({{ width }}x{{ height }}px). Les vidéos carrées ne sont pas autorisées.

source: The video is landscape oriented ({{ width }}x{{ height }}px). Landscape oriented videos are not allowed.
fr: La vidéo est au format paysage ({{ width }}x{{ height }} px). Les vidéos au format paysage ne sont pas autorisées.

source: The video is portrait oriented ({{ width }}x{{ height }}px). Portrait oriented videos are not allowed.
fr: La vidéo est orientée en portrait ({{ width }}x{{ height }} px). Les vidéos en orientation portrait ne sont pas autorisées.

source: The video file is corrupted.
fr: Le fichier vidéo est corrompu.

source: The video contains multiple streams. Only one stream is allowed.
fr: La vidéo contient plusieurs flux. Un seul flux est autorisé.

# Unsupported video codec &quot;{{ codec }}&quot;.
source: Unsupported video codec "{{ codec }}".
fr: Le codec vidéo «{{ codec }}» est non pris en charge.

# Unsupported video container &quot;{{ container }}&quot;.
source: Unsupported video container "{{ container }}".
fr: Le conteneur vidéo «{{ container }}» est non pris en charge.

source: The image file is corrupted.
fr: Le fichier image est corrompu.

source: The image has too few pixels ({{ pixels }} pixels). Minimum amount expected is {{ min_pixels }} pixels.
fr: L’image comporte trop peu de pixels ({{ pixels }}). La quantité minimale attendue est de {{ min_pixels }} pixels.

source: The image has too many pixels ({{ pixels }} pixels). Maximum amount expected is {{ max_pixels }} pixels.
fr: L’image contient trop de pixels ({{ pixels }}). La quantité maximale attendue est de {{ max_pixels }} pixels.

source: This filename does not match the expected charset.
fr: Le nom de fichier ne correspond pas au jeu de caractères attendu.

source: This form should not contain extra fields.
fr: Ce formulaire ne doit pas contenir de champs supplémentaires.

source: The uploaded file was too large. Please try to upload a smaller file.
fr: Le fichier téléchargé est trop volumineux. Merci d'essayer d'envoyer un fichier plus petit.

source: The CSRF token is invalid. Please try to resubmit the form.
fr: Le jeton CSRF est invalide. Veuillez renvoyer le formulaire.

source: This value is not a valid HTML5 color.
fr: Cette valeur n'est pas une couleur HTML5 valide.

source: Please enter a valid birthdate.
fr: Veuillez entrer une date de naissance valide.

source: The selected choice is invalid.
fr: Le choix sélectionné est invalide.

source: The collection is invalid.
fr: La collection est invalide.

source: Please select a valid color.
fr: Veuillez sélectionner une couleur valide.

source: Please select a valid country.
fr: Veuillez sélectionner un pays valide.

source: Please select a valid currency.
fr: Veuillez sélectionner une devise valide.

source: Please choose a valid date interval.
fr: Veuillez choisir un intervalle de dates valide.

source: Please enter a valid date and time.
fr: Veuillez saisir une date et une heure valides.

source: Please enter a valid date.
fr: Veuillez entrer une date valide.

source: Please select a valid file.
fr: Veuillez sélectionner un fichier valide.

source: The hidden field is invalid.
fr: Le champ masqué n'est pas valide.

source: Please enter an integer.
fr: Veuillez saisir un entier.

source: Please select a valid language.
fr: Veuillez sélectionner une langue valide.

source: Please select a valid locale.
fr: Veuillez sélectionner une langue valide.

source: Please enter a valid money amount.
fr: Veuillez saisir un montant valide.

source: Please enter a number.
fr: Veuillez saisir un nombre.

source: The password is invalid.
fr: Le mot de passe est invalide.

source: Please enter a percentage value.
fr: Veuillez saisir un pourcentage valide.

source: The values do not match.
fr: Les valeurs ne correspondent pas.

source: Please enter a valid time.
fr: Veuillez saisir une heure valide.

source: Please select a valid timezone.
fr: Veuillez sélectionner un fuseau horaire valide.

source: Please enter a valid URL.
fr: Veuillez saisir une URL valide.

source: Please enter a valid search term.
fr: Veuillez saisir un terme de recherche valide.

source: Please provide a valid phone number.
fr: Veuillez fournir un numéro de téléphone valide.

source: The checkbox has an invalid value.
fr: La case à cocher a une valeur non valide.

source: Please enter a valid email address.
fr: Veuillez saisir une adresse email valide.

source: Please select a valid option.
fr: Veuillez sélectionner une option valide.

source: Please select a valid range.
fr: Veuillez sélectionner une plage valide.

source: Please enter a valid week.
fr: Veuillez entrer une semaine valide.
